In [237]:
import pandas as pd

In [239]:
raw_data = pd.read_csv("WalmartSales.csv")
raw_data.columns

Index(['Invoice ID', 'Branch', 'City', 'Customer type', 'Gender',
       'Product line', 'Unit price', 'Quantity', 'Tax 5%', 'Total', 'Date',
       'Time', 'Payment', 'cogs', 'gross margin percentage', 'gross income',
       'Rating'],
      dtype='object')

COLUMNS RENAMING
- REPLACING " " TO "_"
- CONVERT FIRST SMALL WORD LETTER TO UPPER

CLEANING THE DATA TYPES
- CONVERT DATE AND TIME COLUMNS TO  DATETIME

In [244]:
raw_data['Date']  = pd.to_datetime(raw_data['Date'])
raw_data['Time']  = pd.to_datetime(raw_data['Time']).dt.time

C:\Users\User\AppData\Local\Temp\ipykernel_20732\4011120249.py:2: UserWarning: Could not infer format, so each element will be parsed individually, falling back to `dateutil`. To ensure parsing is consistent and as-expected, please specify a format.
  raw_data['Time']  = pd.to_datetime(raw_data['Time']).dt.time

In [245]:
raw_data = raw_data.rename(columns={"Customer type":"Customer_Type","Product line":"Product_Line",
                            "Unit price":"Unit_Price","Tax 5%" : "5%_Tax", "cogs":"Cogs",
                                     "gross margin percentage":"Gross_Margin_Percentage","gross income":"Gross_Income"}).copy()

HIGHEST GROSS INCOME CITIES
- NAYPYTITAW IS THE HIGHEST GROSS INCOME

In [249]:
raw_data[["City","Gross_Income"]].groupby(["City"]).sum(['Gross_Income']).sort_values(["Gross_Income"],ascending=False)

           Gross_Income
City
Naypyitaw     5265.1765
Yangon        5057.1605
Mandalay      5057.0320

HIGHEST MONTHLY GROSS INCOME

In [251]:
raw_data["Month_Name"] = pd.to_datetime(raw_data['Date']).dt.month_name()
raw_data[["Month_Name","Gross_Income"]].groupby(["Month_Name"]).sum(["Gross_Income"]).sort_values(["Gross_Income"],ascending=False)

            Gross_Income
Month_Name
January         5537.708
March           5212.167
February        4629.494

TOP PRODUCT LINE BASED ON TOTAL GROSS INCOME

In [256]:
topproduct = raw_data[["Product_Line","Gross_Income"]].groupby(["Product_Line",]).sum(["Gross_Income"]).sort_values(["Gross_Income"],ascending = False)
topproduct

                        Gross_Income
Product_Line
Food and beverages         2673.5640
Sports and travel          2624.8965
Electronic accessories     2587.5015
Fashion accessories        2585.9950
Home and lifestyle         2564.8530
Health and beauty          2342.5590

MOST PRODUCT LINE SALES BY GENDER (MALE & FEMALE)

In [278]:
raw_data.groupby(["Product_Line"]).value_counts(['Gender'])

Product_Line            Gender
Electronic accessories  Male      86
                        Female    84
Fashion accessories     Female    96
                        Male      82
Food and beverages      Female    90
                        Male      84
Health and beauty       Male      88
                        Female    64
Home and lifestyle      Male      81
                        Female    79
Sports and travel       Female    88
                        Male      78
Name: count, dtype: int64

MOST USED PAYMENT METHOD

In [284]:
raw_data.value_counts(["Payment"])

Payment
Ewallet        345
Cash           344
Credit card    311
Name: count, dtype: int64

In [ ]:
GENDER THAT SPEND MOST

In [302]:
raw_data[["Gender","Total"]].groupby(["Gender"]).sum(["Total"])

             Total
Gender
Female  167882.925
Male    155083.824